{
  "nav": {
    "home": "Accueil",
    "about": "À propos de moi",
    "projects": "Projets",
    "contact": "Me contacter",
    "language": "Langue"
  },
  "home": {
    "title": "Accueil | Portfolio de Pornchai",
    "mainTitle": "Je suis",
    "subTitle": "Développeur Front-end",
    "introTitle": "À propos de moi",
    "projectsTitle": "Mes projets",
    "standardenLigne": "Standard En Ligne",
    "villaduBonheur": "Villa du Bonheur",
    "lataverneduDesign": "La Taverne du Design",
    "viewMoreProjects": "Voir plus de projets",
    "viewMore": "Voir plus",
    "viewLess": "Voir moins",
    "downloadCV": "Télécharger CV",
    "bachelor": "BAC+3 Concepteur développeur d'applications",
    "myProjects": "Mes projets",
    "moreAboutMe": "Plus à propos de moi",
    "introText": "Diplômé de l'EFREI Paris, je recherche actuellement un poste de développeur front-end à Grenoble. Passionné par l'univers du web depuis l'âge de 15 ans, je conçois des interfaces fluides et esthétiques qui optimisent l'expérience utilisateur.\n\nParcours & Compétences\nAu cours de ma formation à l'EFREI Paris, j'ai développé une forte autonomie et une capacité d'adaptation rapide. Cette école nous encourage à être autodidactes dès la première année, renforçant ma passion déjà existante pour l'apprentissage continu.\n\nMon expertise s'est construite à travers diverses missions client:\n• Création de sites web vitrines pour la restauration\n• Développement d'applications mobiles iOS et Android\n• Conception et gestion de bases de données avec systèmes de recherche avancés\n• Et de nombreux autres projets sur mesure\n\nApproche Professionnelle\nJe m'investis pleinement dans chaque projet avec une démarche structurée:\n• Échange approfondi pour cerner les besoins\n• Définition précise des problématiques\n• Développement avec suivi régulier\n• Livraison et installation professionnelles\n\nDe nature calme et collaborative, je m'adapte facilement aux nouvelles technologies et méthodologies pour répondre efficacement aux défis techniques.\n\nObjectif Professionnel\nMon ambition est d'apporter un code de qualité et des solutions créatives à des projets ambitieux. Si vous recherchez un profil motivé pour rejoindre votre équipe, je serais ravi d'échanger sur vos besoins et ma contribution potentielle.\n\nN'hésitez pas à me contacter pour toute information supplémentaire."
  },
  "about": {
    "title": "À propos de moi",
    "bioTitle": "À propos de moi",
    "bioText": "Né en Thaïlande, mon parcours a été marqué par des événements qui ont façonné ma résilience et ma détermination. J'ai vécu le tsunami de 2004, une expérience qui a profondément influencé ma vision de la vie. Suite à cet événement, ma famille et moi avons emménagé en France où j'ai commencé mon intégration dans une nouvelle culture.\n\nQuelques années plus tard, je suis retourné en Thaïlande pour y effectuer mon baccalauréat, me reconnectant avec mes racines tout en gardant une perspective internationale. Cette double culture m'a offert une vision unique et m'a poussé à revenir en France pour poursuivre mes études supérieures à l'EFREI Paris, où j'ai développé ma passion pour le développement web et le design d'interfaces.\n\nAujourd'hui, en tant que développeur front-end, je combine rigueur technique et sensibilité créative, influencées par mon parcours multiculturel unique.",
    "formationTitle": "Formation",
    "formationEfrei": "EFREI Paris (2019-2023)",
    "formationEfreiText": "Diplôme d'ingénieur en informatique, spécialisation en développement web et technologies front-end.",
    "formationLycée": "Lycée International de Bangkok (2016-2019)",
    "formationLycéeText": "Baccalauréat scientifique avec mention, option sciences de l'ingénieur.",
    "experiencesTitle": "Expertise technique",
    "frontendTech": "Technologies front-end maîtrisées",
    "frontendTechList": [
      "React.js - Création d'interfaces utilisateur dynamiques et interactives",
      "Next.js - Développement d'applications React avec rendu côté serveur",
      "SCSS/Sass - Stylisation avancée avec variables, mixins et structures imbriquées",
      "Animations CSS - Conception d'interfaces vivantes grâce à des animations fluides",
      "JavaScript ES6+ - Manipulation DOM avancée et programmation asynchrone"
    ],
    "responsiveApproach": "Approche responsive",
    "responsiveText": "Je conçois chaque interface avec une philosophie mobile-first, garantissant une expérience utilisateur optimale sur tous les appareils. Mon approche du responsive design repose sur :",
    "responsiveList": [
      "Utilisation de grilles flexibles et adaptatives",
      "Media queries stratégiquement positionnées",
      "Images et contenus optimisés pour différentes résolutions",
      "Tests rigoureux sur multiples appareils et navigateurs"
    ],
    "uiux": "UI/UX",
    "uiuxText": "Ma conception d'interfaces s'articule autour de principes fondamentaux :",
    "uiuxList": [
      "Hiérarchie visuelle claire pour guider l'utilisateur",
      "Espacement et typographie soignés pour une lisibilité optimale",
      "Palettes de couleurs harmonieuses et cohérentes avec l'identité de marque",
      "Microinteractions subtiles améliorant l'engagement utilisateur"
    ],
    "info": {
      "age": "Âge",
      "status": "Statut",
      "jobSearch": "Recherche d'emploi",
      "nationality": "Nationalité",
      "email": "Email",
      "contactMe": "Me contacter"
    },
    "mySkills": "Mes habilités"
  },
  "project": {
    "title": "Projets",
    "standardDescription": "Après trois ans d’alternance en développement web, j’ai contribué à la mise en place d’un standard téléphonique virtuel complet : numéro local, SVI, gestion des horaires, suivi en ligne, tunnel de commande intuitif, ainsi que la création d’un back office pour la gestion autonome des services par les utilisateurs.",
    "standardFeature1": "Création de tunnel de commandes sécurisé",
    "standardFeature2": "Intégration Stripe pour les paiements",
    "standardFeature3": "Front-end responsive et interactif",
    "standardFeature4": "Base de données MySQL et MongoDB",
    "villaDescription": "Un site vitrine élégant pour une villa de luxe, intégrant des systèmes de réservation pour offrir une expérience client complète.",
    "villaFeature1": "Intégration avec Airbnb et Booking",
    "villaFeature2": "Site vitrine avec design premium",
    "villaFeature3": "Développé avec React et Vite",
    "taverneDescription": "Refonte complète d'un site pour un studio de design, mettant l'accent sur l'expérience utilisateur et les performances.",
    "taverneFeature1": "Refonte complète avec nouvelles technologies",
    "taverneFeature2": "Intégration de Swiper pour des transitions fluides",
    "taverneFeature3": "Performance et esthétique optimisées"
  },
  "contact": {
    "title": "Me contacter"
  },
  "footer": {
    "title": "Portfolio",
    "social": "Social",
    "cv": "CV",
    "linkedin": "LinkedIn"
  }
}