{
  "nav": {
    "home": "Home",
    "about": "About Me",
    "projects": "Projects",
    "contact": "Contact Me",
    "language": "Language"
  },
  "home": {
    "title": "Home | Pornchai's Portfolio",
    "mainTitle": "I am",
    "subTitle": "Front-end Developer",
    "introTitle": "About Me",
    "standardenLigne": "Standard En Ligne",
    "villaduBonheur": "Villa du Bonheur",
    "lataverneduDesign": "La Taverne du Design",
    "projectsTitle": "My Projects",
    "viewMoreProjects": "View More Projects",
    "viewMore": "View More",
    "viewLess": "View Less",
    "downloadCV": "Download CV",
    "bachelor": "Bachelor's Degree in Application Design and Development",
    "myProjects": "My Projects",
    "moreAboutMe": "More About Me",
    "introText": "A graduate of EFREI Paris, I am currently seeking a front-end developer position in Grenoble. Passionate about the web since the age of 15, I design fluid and aesthetic interfaces that optimize user experience.\n\nJourney & Skills\nDuring my training at EFREI Paris, I developed strong autonomy and quick adaptability. This school encourages self-learning from the first year, reinforcing my pre-existing passion for continuous learning.\n\nMy expertise has been built through various client projects:\n• Creation of showcase websites for restaurants\n• Development of iOS and Android mobile applications\n• Design and management of databases with advanced search systems\n• And many other custom projects\n\nProfessional Approach\nI fully invest in each project with a structured approach:\n• In-depth discussions to understand needs\n• Precise definition of challenges\n• Development with regular follow-ups\n• Professional delivery and installation\n\nCalm and collaborative by nature, I easily adapt to new technologies and methodologies to effectively tackle technical challenges.\n\nProfessional Goal\nMy ambition is to deliver quality code and creative solutions to ambitious projects. If you're looking for a motivated profile to join your team, I'd be delighted to discuss your needs and my potential contribution.\n\nFeel free to contact me for any additional information."
  },
  "about": {
    "title": "About Me",
    "bioTitle": "About Me",
    "bioText": "Born in Thailand, my journey has been shaped by events that forged my resilience and determination. I experienced the 2004 tsunami, an event that profoundly influenced my outlook on life. Following this, my family and I moved to France, where I began integrating into a new culture.\n\nA few years later, I returned to Thailand to complete my high school diploma, reconnecting with my roots while maintaining an international perspective. This dual culture has given me a unique outlook and motivated me to return to France for higher education at EFREI Paris, where I developed my passion for web development and interface design.\n\nToday, as a front-end developer, I combine technical rigor and creative sensitivity, influenced by my unique multicultural background.",
    "formationTitle": "Education",
    "formationEfrei": "EFREI Paris (2019-2023)",
    "formationEfreiText": "Engineering degree in computer science, specializing in web development and front-end technologies.",
    "formationLycée": "Bangkok International High School (2016-2019)",
    "formationLycéeText": "Scientific high school diploma with honors, engineering sciences option.",
    "experiencesTitle": "Technical Expertise",
    "frontendTech": "Mastered Front-end Technologies",
    "frontendTechList": [
      "React.js - Creation of dynamic and interactive user interfaces",
      "Next.js - Development of React applications with server-side rendering",
      "SCSS/Sass - Advanced styling with variables, mixins, and nested structures",
      "CSS Animations - Design of lively interfaces with smooth animations",
      "JavaScript ES6+ - Advanced DOM manipulation and asynchronous programming"
    ],
    "responsiveApproach": "Responsive Approach",
    "responsiveText": "I design every interface with a &quot;mobile-first&quot; philosophy, ensuring an optimal user experience across all devices. My responsive design approach is based on:",
    "responsiveList": [
      "Use of flexible and adaptive grids",
      "Strategically placed media queries",
      "Optimized images and content for various resolutions",
      "Rigorous testing across multiple devices and browsers"
    ],
    "uiux": "UI/UX",
    "uiuxText": "My interface design revolves around fundamental principles:",
    "uiuxList": [
      "Clear visual hierarchy to guide the user",
      "Careful spacing and typography for optimal readability",
      "Harmonious and consistent color palettes aligned with brand identity",
      "Subtle microinteractions enhancing user engagement"
    ],
    "info": {
      "age": "Age",
      "status": "Status",
      "jobSearch": "Job Search",
      "nationality": "Nationality",
      "email": "Email",
      "contactMe": "Contact Me"
    },
    "mySkills": "My Skills"
  },
  "project": {
    "title": "Projects",
    "standardDescription": "A complete e-commerce platform for a standard restaurant, offering a smooth user experience and efficient online order management.",
    "standardFeature1": "Creation of a secure order funnel",
    "standardFeature2": "Stripe integration for payments",
    "standardFeature3": "Responsive and interactive front-end",
    "standardFeature4": "MySQL and MongoDB databases",
    "villaDescription": "An elegant showcase website for a luxury villa, integrating booking systems for a comprehensive client experience.",
    "villaFeature1": "Integration with Airbnb and Booking",
    "villaFeature2": "Showcase site with premium design",
    "villaFeature3": "Developed solo with React and Vite",
    "taverneDescription": "Complete redesign of a website for a design studio, focusing on user experience and performance.",
    "taverneFeature1": "Full redesign with modern technologies",
    "taverneFeature2": "Integration of Swiper for smooth transitions",
    "taverneFeature3": "Optimized performance and aesthetics"
  },
  "contact": {
    "title": "Contact Me"
  },
  "footer": {
    "title": "Portfolio",
    "social": "Social",
    "cv": "CV",
    "linkedin": "LinkedIn"
  }
}